Tekla Open API Reference for Tekla Structures 2025
IDoubleDataType Interface
 The IDoubleDataType interface is an interface for the Tekla.Structures.Datatype.* types whose value is a double.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IDoubleDataType : IDataType
Public Interface IDoubleDataType
	Inherits IDataType
The IDoubleDataType type exposes the following members.
Properties
Name | Description
Value
 The double value of the field.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace